app/controllers/orders_controller.rb

SELECT COUNT(*) FROM "orders"
---
  def index
    @search_term = params[:search_term]

    # Usar o método de busca combinada com paginação
    @orders = Order.search_by_term(@search_term).recent.page(params[:page]).per(6)

INSERT INTO "orders" ("user_id", "pickup_address", "delivery_address", "items_description", "requested_at", "estimated_value", "created_at", "updated_at") VALUES (1, 'Rua americo vespúcio, 1131 - Itaperi', 'Av. Principal,456 - Bairro Novo.', '1 smartwatch', '2025-07-21 20:23:14.110440', 300.0, '2025-07-21 20:23:14.113234', '2025-07-21 20:23:14.113234') RETURNING "id"
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save